import { IAllData } from "../models/IAllData";
import { ISlide } from "../models/ISlide";

export const dataSlideOne = <ISlide[]>[
  {
    year: 1987,
    text: "Хищник/Predator, США(реж. Джон Мактирнан)",
  },
  {
    year: 1988,
    text: "Кто подставил кролика Роджера/Who Framed Roger Rabbit, США (реж. Роберт Замексис) ",
  },
  {
    year: 1989,
    text: "Назад в будущее 2/ Back To The Future 2, США (реж. Роберт Земексис) ",
  },
  {
    year: 1990,
    text: "Крепкие Орешки/Tough nuts, США(реж. Джон Мактирнан)",
  },
  {
    year: 1991,
    text: "Семейка Аддамс/ The Addams Family, США (реж Барри Зонненфельд)",
  },
];

export const dataSlideTwo = <ISlide[]>[
  {
    year: 1992,
    text: "Нобелевская премия по литературе - Дерек Уолкотт, За блестящий образец карибского эпоса в 64 разделах",
  },
  {
    year: 1993,
    text: "Бессоница - роман Стивена Кинга",
  },
  {
    year: 1995,
    text: "Гарри Поттер и Философский камень - Джоан Роулинг",
  },
  {
    year: 1996,
    text: "  Компания Tesla официально представила первый в мире электрический грузовик Tesla Semi",
  },
];

export const dataSlideThree = <ISlide[]>[
  {
    year: 1997,
    text: "Премьера балета Золушка в постановке Жан-Кристофа Майо, сценография Эрнеста Пиньона",
  },
  {
    year: 1998,
    text: "Возобновлено издание журанала Театр",
  },
  {
    year: 1999,
    text: "Премьера трилогии Тома Стоппарда - Берег Утопии, Королевский Национальный театр, Лондон",
  },
  {
    year: 2001,
    text: " 13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды",
  },
];

export const dataSlideFour = <ISlide[]>[
  {
    year: 2003,
    text: " Телескоп «Хаббл» обнаружил самую удалённую из всех обнаруженных галактик, получившую обозначение GN-z11",
  },
  {
    year: 2004,
    text: "  Компания Tesla официально представила первый в мире электрический грузовик Tesla Semi",
  },
  {
    year: 2005,
    text: " 13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды",
  },
  {
    year: 2006,
    text: " 13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды",
  },
];

export const dataSlideFive = <ISlide[]>[
  {
    year: 2007,
    text: " Нобелевская премия по литературе - Дерек Уолкотт, За блестящий образец карибского эпоса в 64 разделах",
  },
  {
    year: 2008,
    text: " Премьера балета Золушка в постановке Жан-Кристофа Майо, сценография Эрнеста Пиньона",
  },
  {
    year: 2009,
    text: "  Компания Tesla официально представила первый в мире электрический грузовик Tesla Semi",
  },
  {
    year: 2012,
    text: "Нобелевская премия по литературе - Дерек Уолкотт, За блестящий образец карибского эпоса в 64 разделах",
  },
  {
    year: 2014,
    text: " Телескоп «Хаббл» обнаружил самую удалённую из всех обнаруженных галактик, получившую обозначение GN-z11",
  },
];

export const dataSlideSix = <ISlide[]>[
  {
    year: 2015,
    text: " 13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды",
  },
  {
    year: 2016,
    text: " Телескоп «Хаббл» обнаружил самую удалённую из всех обнаруженных галактик, получившую обозначение GN-z11",
  },
  {
    year: 2019,
    text: " 13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды",
  },
  {
    year: 2021,
    text: " 13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды",
  },
  {
    year: 2022,
    text: " 13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды",
  },
];

export const AllData = <IAllData[]>[
  { id: 1, data: dataSlideOne },
  { id: 2, data: dataSlideTwo },
  { id: 3, data: dataSlideThree },
  { id: 4, data: dataSlideFour },
  { id: 5, data: dataSlideFive },
  { id: 6, data: dataSlideSix },
];
