import { ISlide } from "../models/ISlide";

export const dataSlide = <ISlide[]>[
  {
    year: 2015,
    text: " 13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды",
  },
  {
    year: 2016,
    text: " Телескоп «Хаббл» обнаружил самую удалённую из всех обнаруженных галактик, получившую обозначение GN-z11",
  },
  {
    year: 2017,
    text: "  Компания Tesla официально представила первый в мире электрический грузовик Tesla Semi",
  },
  {
    year: 2018,
    text: " 13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды",
  },
];
